app/Controllers/Home.php

    public function detail($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('gedung_a');

        $query = $builder->where('id', $id)->get();
---
SELECT *
FROM `gedung_a`
WHERE `id` = '310'

    public function search_label()
    {
        $keyword = $this->request->getVar('query');
        $db      = \Config\Database::connect();
        $builder = $db->table('gedung_a');

        $query = $builder->like('po', $keyword)->orLike('qty', $keyword)->get();
---
SELECT *
FROM `gedung_a`
WHERE `po` LIKE '%1333444%' ESCAPE '!'
OR  `qty` LIKE '%1333444%' ESCAPE '!'